survey_title = "ТЕСТУВАННЯ 40"

questions = [
    {
        "question": "Яка довжина ствола вашої гвинтівкив дюймах?",
        "options": ["22", "27", "24,5", "20"],
        "correct": 0  # Номер правильної відповіді
    },
    {
        "question": "Яка довжина ствола вашої гвинтівкив дюймах?",
        "options": ["22", "27", "24,5", "20"],
        "correct": 1  # Номер правильної відповіді
    },
    {
        "question": "Яка довжина ствола вашої гвинтівкив дюймах?",
        "options": ["22", "27", "24,5", "20"],
        "correct": 2  # Номер правильної відповіді
    },
    {
        "question": "Яка довжина ствола вашої гвинтівкив дюймах?",
        "options": ["22", "27", "24,5", "20"],
        "correct": 3  # Номер правильної відповіді
    },
    {
        "question": "Яка довжина ствола вашої гвинтівкив дюймах?",
        "options": ["22", "27", "24,5", "20"],
        "correct": 3  # Номер правильної відповіді
    },
    {
        "question": "Яка довжина ствола вашої гвинтівкив дюймах?",
        "options": ["22", "27", "24,5", "20"],
        "correct": 0  # Номер правильної відповіді
    },
]
