survey_title = "ТЕСТ 40 ПИТАНЬ"

questions = [
    {
        "number": 1,
        "question": "Довжина ствола вашої гвинтівки, в дюймах?",
        "options": ["22", "27", "24,5", "20"],
        "correct": [3],
        "depends_on": None
    },
    {
        "number": 2,
        "question": "Перегаз – гільза при пострілі вилітає на:",
        "options": ["05:00 - 3:30", "02:00 - 03:00", "2:30 - 3:30", "01:00 - 02:30"],
        "correct": [3],
        "depends_on": None
    },
    {
        "number": 3,
        "question": "Недогаз - гільза при пострілі вилітає на:",
        "options": ["03:30 - 02:30", "03:30 - 05:00", "01:00 - 02:00", "10:00 - 11:30"],
        "correct": [1],
        "depends_on": None
    },
    {
        "number": 4,
        "question": "***Крок нарізів вашого ствола, вказати рік випуску гвинтівки?",
        "options": ["1:12”", "1:11” 2019", "1:8”", "1:10” 2023"],
        "correct": [3],
        "depends_on": None
    },
    {
        "number": 5,
        "question": "Контур ствола:",
        "options": ["Матчевий", "Важкий", "Легкий", "Середній"],
        "correct": [0],
        "depends_on": None
    },
    {
        "number": 6,
        "question": "Для чого потрібно регулювати паралакс на дистанції?",
        "options": ["Для чіткості сітки", "Для чіткості цілі відносно кратності", "Для чіткості міражу", "Для виведення цілі і сітки прицілу в одну площину"],
        "correct": [3],
        "depends_on": None
    },
    {
        "number": 7,
        "question": "***Маркування вашого прицілу відповідно року випуску гвинтіки",
        "options": ["Leupold Mark 4 7.5-25x50", "Leupold Mark 4 6.5-20x50", "Leupold Mark 5HD 5-25x56", "Leupold Mark 4 6.5-25x50", "Leupold Mark 4 6.8-20x50", "Leupold Mark 5HD 6.5-25x50"],
        "correct": [1,2],
        "depends_on": None
    },
    {
        "number": 8,
        "question": "***Діаметр трубки корпусу вашого прицілу відповідно року випуску вашої гвинтівки",
        "options": ["30мм", "34мм", "50мм", "35мм", "56мм"],
        "correct": [0,3],
        "depends_on": None
    },
    {
        "number": 9,
        "question": "***Діаметр обʼєктиву прицілу відповідно року випуску вашої гвинтівки",
        "options": ["30мм", "34мм", "56мм", "50мм", "43мм", "55мм"],
        "correct": [3,2],
        "depends_on": None
    },
    {
        "number": 10,
        "question": "Яке з тверджень найбільш влучно описує термін «Снайперська гвинтівка»?",
        "options": ["Снайперська гвинтівка - це гвинтівка, яка обладнана оптичним прицілом для ведення високоточної стрільби по поодиноких цілях", "Снайперська гвинтівка - це гвинтівка, яка обладнана оптичним прицілом для ведення стрільби на коротких та середніх відстанях", "Снайперська гвинтівка це гвинтівка, яка використовується снайперами"],
        "correct": [0],
        "depends_on": None
    },
    {
        "number": 11,
        "question": "***Які види снайперських гвинтівок за типом заряджання ви знаєте? (Оберіть 2 варіанти)",
        "options": ["Автоматична гвинтівка", "Гвинтівка з повздовжнім затвором", "Напівавтоматична гвинтівка", "Гвинтівка з повздовжньо-ковзаючим затвором"],
        "correct": [2,3],
        "depends_on": None
    },
    {
        "number": 12,
        "question": "Скільки МОА в 15 MRAD (точне значення)?",
        "options": ["50.57 МОА", "51.57 МОА", "53.56 МОА", "52.57 МОА"],
        "correct": [1],
        "depends_on": None
    },
    {
        "number": 13,
        "question": "Вирахуйте розмір цілі в сантиметрах, за умови відстань до цілі 600 м. ширина цілі 0.5 MRAD:",
        "options": ["40 см.", "30 см.", "20 см.", "50 см."],
        "correct": [1],
        "depends_on": None
    },
    {
        "number": 14,
        "question": "Дайте точне значення 1MOA на 100 метрів, відповідь в см?",
        "options": ["3.0231см", "2.9089см", "2.5452", "2.9108"],
        "correct": [1],
        "depends_on": None
    },
    {
        "number": 15,
        "question": "Скільки ярдів у 100м?",
        "options": ["114", "109", "132", "91"],
        "correct": [1],
        "depends_on": None
    },
    {
        "number": 16,
        "question": "Яка з гвинтівок є антиматеріальною?",
        "options": ["AIXMC 338", "Barrett M82A1", "M24", "TRG 22"],
        "correct": [1],
        "depends_on": None
    },
    {
        "number": 12,
        "question": "Які кутові величини ви знаєте?",
        "options": ["МОА, Mil, Дюйм, Тисячна", "Mil, МОА, Тисячна, Фунт.", "МОА, Mil, Градус, Тисячна"],
        "correct": [2],
        "depends_on": None
    },
    {
        "number": 13,
        "question": "Балістика – це:",
        "options": ["Наука, що вивчає рух і зіткнення предметів", "Наука, що вивчає поводження предметів у просторі", "Наука, що вивчає рух і зіткнення снарядів"],
        "correct": [2],
        "depends_on": None
    },
    {
        "number": 14,
        "question": "Що таке «твіст»?",
        "options": ["Це розмір нарізу", "Це відстань, за яку куля робить повний оберт у каналі ствола", "Це відстань від патронника до нарізів"],
        "correct": [1],
        "depends_on": None
    },
    {
        "number": 15,
        "question": "Скільки секунд в одному градусі?",
        "options": ["60", "360", "600", "3600"],
        "correct": [3],
        "depends_on": None
    },
    {
        "number": 16,
        "question": "Поправка на дистанцію на вітер 1 MRAD на повний вітер. Яка буде поправка, якщо напрямок вітру буде з 01:00?",
        "options": ["1.5 MRAD", "1 MRAD", "0.5 MRAD", "0.3 MRAD"],
        "correct": [2],
        "depends_on": None
    },
    {
        "number": 17,
        "question": "***Які з переліку назв сіток вказані на малюнках?",
        "options": ["TMR", "MIL-R", "MIL-DOT", "MIL-MOA", "Duplex Crosshair", "Пеньок", "Posp", "TRR", "Horus"],
        "correct": [2,4,8],
        "depends_on": None
    },
    {
        "number": 18,
        "question": "Дайте опис Балістичної (тактичної) сітки.",
        "options": ["Призначені для визначення дистанції до об'єкта (цілі), для швидкого коректування поправок на дистанції і за вітром", "Сітки простіші у виконанні, так як стрільба ведеться в основному на середніх і малих дистанціях. Прицільні сітки, в основному засновані на простому перехресті"],
        "correct": [1],
        "depends_on": None
    },
    {
        "number": 19,
        "question": "Які кутові величини ви знаєте?",
        "options": ["МОА, Mil, Дюйм, Тисячна", "Mil, МОА, Тисячна, Фунт", "МОА, Mil, Градус, Тисячна"],
        "correct": [2],
        "depends_on": None
    },
    {
        "number": 20,
        "question": "Балістик-це",
        "options": ["Наука, що вивчає рух і зіткнення предметів, за певною траєкторією.", "Наука, що вивчає поводження предметів у просторі, таких як кулі, бомби і ракети", "Наука, що вивчає рух і зіткнення снарядів, таких як кулі, бомби і ракети"],
        "correct": [2],
        "depends_on": None
    },
    {
        "number": 21,
        "question": "Постріл поділяється на такі періоди:",
        "options": ["Перший, Другий, Третій, Період після дії газів", "Попередній, Основний,Другий, Третій", "Перший, Основний, Другий, Третій , Період післядії газів"],
        "correct": [1],
        "depends_on": None
    },
    {
        "number": 22,
        "question": "Що таке твіст?",
        "options": ["Це розмір нарізу на який куля заходить у каналі ствола", "Це відстань за який куля робить повний оберт навколо своєї осі у каналі ствола", "Це відстань від патронника до нарізів", "Це відстань яку куля проходить до повного виходу з каналу ствола"],
        "correct": [1],
        "depends_on": None
    },
    {
        "number": 23,
        "question": "Що таке третій період Внутрішньої балістики?",
        "options": ["Період після дії газів триває від моменту вильоту кулі з каналу ствола до моменту зупинки дії порохових газів на кулю (10-15 см від ствола)", "Основний період триває від початку руху кулі до моменту повного згорання порохового заряду", "Триває від початку горіння порохового заряду до повного врізання оболонки кулі в нарізи ствола", "З початком цього періоду приток порохових газів зупиняється, однак сильно стиснуті та нагріті гази розширюються та спричиняють тиск на кулю, збільшуючи швидкість її руху"],
        "correct": [0],
        "depends_on": None
    },
    {
        "number": 8,
        "question": "",
        "options": ["", ""],
        "correct": [],
        "depends_on": None
    },
    {
        "number": 24,
        "question": "Що вивчає термінальна балістика?",
        "options": ["Дію снаряду на тіло людини", "Дію снаряду на перешкоду", "Поводження снаряду перед влучанням"],
        "correct": [1],
        "depends_on": None
    },
    {
        "number": 19,
        "question": "Для чого потрібен блокнот снайпера?",
        "options": ["Для ведення формуляра", "Для записів аналізу результатів стрільби", "Для записів результатів стрільби та аналізу впливу факторів"],
        "correct": [2],
        "depends_on": None
    },
    {
        "number": 20,
        "question": "На якому етапі заповнення снайперського блокноту ми записуємо дані на вітер?",
        "options": ["Під час стрільби", "Після стрільби", "Перед стрільбою", "Напередодні"],
        "correct": [2],
        "depends_on": None
    }
]
