survey_title = "ТЕСТ 40 ПИТАНЬ"

questions = [
    {
        "number": 1,
        "question": "Довжина ствола вашої гвинтівки, в дюймах?",
        "options": ["22", "27", "24,5", "20"],
        "correct": [3],
        
    },
    {
        "number": 2,
        "question": "Перегаз – гільза при пострілі вилітає на:",
        "options": ["05:00 - 3:30", "02:00 - 03:00", "2:30 - 3:30", "01:00 - 02:30"],
        "correct": [3],
        
    },
    {
        "number": 3,
        "question": "Недогаз - гільза при пострілі вилітає на:",
        "options": ["03:30 - 02:30", "03:30 - 05:00", "01:00 - 02:00", "10:00 - 11:30"],
        "correct": [1],
        
    },
    {
        "number": 4,
        "question": "***Крок нарізів вашого ствола, вказати рік випуску гвинтівки?",
        "options": ["1:12”", "1:11” 2019", "1:8”", "1:10” 2023"],
        "correct": [3],
        
    },
    {
        "number": 5,
        "question": "Контур ствола:",
        "options": ["Матчевий", "Важкий", "Легкий", "Середній"],
        "correct": [0],
        
    },
    {
        "number": 6,
        "question": "Для чого потрібно регулювати паралакс на дистанції?",
        "options": ["Для чіткості сітки", "Для чіткості цілі відносно кратності", "Для чіткості міражу", "Для виведення цілі і сітки прицілу в одну площину"],
        "correct": [3],
        
    },
    {
        "number": 7,
        "question": "***Маркування вашого прицілу відповідно року випуску гвинтіки",
        "options": ["Leupold Mark 4 7.5-25x50", "Leupold Mark 4 6.5-20x50", "Leupold Mark 5HD 5-25x56", "Leupold Mark 4 6.5-25x50", "Leupold Mark 4 6.8-20x50", "Leupold Mark 5HD 6.5-25x50"],
        "correct": [1,2],
        
    },
    {
        "number": 8,
        "question": "***Діаметр трубки корпусу вашого прицілу відповідно року випуску вашої гвинтівки",
        "options": ["30мм", "34мм", "50мм", "35мм", "56мм"],
        "correct": [0,3],
        
    },
    {
        "number": 9,
        "question": "***Діаметр обʼєктиву прицілу відповідно року випуску вашої гвинтівки",
        "options": ["30мм", "34мм", "56мм", "50мм", "43мм", "55мм"],
        "correct": [3,2],
        
    },
    {
        "number": 10,
        "question": "Яке з тверджень найбільш влучно описує термін «Снайперська гвинтівка»?",
        "options": ["Снайперська гвинтівка - це гвинтівка, яка обладнана оптичним прицілом для ведення високоточної стрільби по поодиноких цілях", "Снайперська гвинтівка - це гвинтівка, яка обладнана оптичним прицілом для ведення стрільби на коротких та середніх відстанях", "Снайперська гвинтівка це гвинтівка, яка використовується снайперами"],
        "correct": [0],
        
    },
    {
        "number": 11,
        "question": "***Які види снайперських гвинтівок за типом заряджання ви знаєте? (Оберіть 2 варіанти)",
        "options": ["Автоматична гвинтівка", "Гвинтівка з повздовжнім затвором", "Напівавтоматична гвинтівка", "Гвинтівка з повздовжньо-ковзаючим затвором"],
        "correct": [2,3],
        
    },
    {
        "number": 12,
        "question": "Скільки МОА в 15 MRAD (точне значення)?",
        "options": ["50.57 МОА", "51.57 МОА", "53.56 МОА", "52.57 МОА"],
        "correct": [1],
        
    },
    {
        "number": 13,
        "question": "Вирахуйте розмір цілі в сантиметрах, за умови відстань до цілі 600 м. ширина цілі 0.5 MRAD:",
        "options": ["40 см.", "30 см.", "20 см.", "50 см."],
        "correct": [1],
        
    },
    {
        "number": 14,
        "question": "Дайте точне значення 1MOA на 100 метрів, відповідь в см?",
        "options": ["3.0231см", "2.9089см", "2.5452", "2.9108"],
        "correct": [1],
        
    },
    {
        "number": 15,
        "question": "Скільки ярдів у 100м?",
        "options": ["114", "109", "132", "91"],
        "correct": [1],
        
    },
    {
        "number": 16,
        "question": "Яка з гвинтівок є антиматеріальною?",
        "options": ["AIXMC 338", "Barrett M82A1", "M24", "TRG 22"],
        "correct": [1],
        
    },
    {
        "number": 12,
        "question": "Які кутові величини ви знаєте?",
        "options": ["МОА, Mil, Дюйм, Тисячна", "Mil, МОА, Тисячна, Фунт.", "МОА, Mil, Градус, Тисячна"],
        "correct": [2],
        
    },
    {
        "number": 13,
        "question": "Балістика – це:",
        "options": ["Наука, що вивчає рух і зіткнення предметів", "Наука, що вивчає поводження предметів у просторі", "Наука, що вивчає рух і зіткнення снарядів"],
        "correct": [2],
        
    },
    {
        "number": 14,
        "question": "Що таке «твіст»?",
        "options": ["Це розмір нарізу", "Це відстань, за яку куля робить повний оберт у каналі ствола", "Це відстань від патронника до нарізів"],
        "correct": [1],
        
    },
    {
        "number": 15,
        "question": "Скільки секунд в одному градусі?",
        "options": ["60", "360", "600", "3600"],
        "correct": [3],
        
    },
    {
        "number": 16,
        "question": "Поправка на дистанцію на вітер 1 MRAD на повний вітер. Яка буде поправка, якщо напрямок вітру буде з 01:00?",
        "options": ["1.5 MRAD", "1 MRAD", "0.5 MRAD", "0.3 MRAD"],
        "correct": [2],
        
    },
    {
        "number": 17,
        "question": "***Які з переліку назв сіток вказані на малюнках?",
        "options": ["TMR", "MIL-R", "MIL-DOT", "MIL-MOA", "Duplex Crosshair", "Пеньок", "Posp", "TRR", "Horus"],
        "correct": [2,4,8],
        
    },
    {
        "number": 18,
        "question": "Дайте опис Балістичної (тактичної) сітки.",
        "options": ["Призначені для визначення дистанції до об'єкта (цілі), для швидкого коректування поправок на дистанції і за вітром", "Сітки простіші у виконанні, так як стрільба ведеться в основному на середніх і малих дистанціях. Прицільні сітки, в основному засновані на простому перехресті"],
        "correct": [1],
        
    },
    {
        "number": 19,
        "question": "Які кутові величини ви знаєте?",
        "options": ["МОА, Mil, Дюйм, Тисячна", "Mil, МОА, Тисячна, Фунт", "МОА, Mil, Градус, Тисячна"],
        "correct": [2],
        
    },
    {
        "number": 20,
        "question": "Балістик-це",
        "options": ["Наука, що вивчає рух і зіткнення предметів, за певною траєкторією.", "Наука, що вивчає поводження предметів у просторі, таких як кулі, бомби і ракети", "Наука, що вивчає рух і зіткнення снарядів, таких як кулі, бомби і ракети"],
        "correct": [2],
        
    },
    {
        "number": 21,
        "question": "Постріл поділяється на такі періоди:",
        "options": ["Перший, Другий, Третій, Період після дії газів", "Попередній, Основний,Другий, Третій", "Перший, Основний, Другий, Третій , Період післядії газів"],
        "correct": [1],
        
    },
    {
        "number": 22,
        "question": "Що таке твіст?",
        "options": ["Це розмір нарізу на який куля заходить у каналі ствола", "Це відстань за який куля робить повний оберт навколо своєї осі у каналі ствола", "Це відстань від патронника до нарізів", "Це відстань яку куля проходить до повного виходу з каналу ствола"],
        "correct": [1],
        
    },
    {
        "number": 23,
        "question": "Що таке третій період Внутрішньої балістики?",
        "options": ["Період після дії газів триває від моменту вильоту кулі з каналу ствола до моменту зупинки дії порохових газів на кулю (10-15 см від ствола)", "Основний період триває від початку руху кулі до моменту повного згорання порохового заряду", "Триває від початку горіння порохового заряду до повного врізання оболонки кулі в нарізи ствола", "З початком цього періоду приток порохових газів зупиняється, однак сильно стиснуті та нагріті гази розширюються та спричиняють тиск на кулю, збільшуючи швидкість її руху"],
        "correct": [0],
        
    },
    {
        "number": 24,
        "question": "Що вивчає термінальна балістика?",
        "options": ["Дію снаряду на тіло людини", "Дію снаряду на перешкоду", "Поводження снаряду перед влучанням"],
        "correct": [1],
        
    },
    {
        "number": 25,
        "question": "Для чого потрібен блокнот снайпера?",
        "options": ["Для ведення формуляра та звітності керівництву", "Для записів аналізу результатів своєї стрільби  та напрацьованих навичок впливу зовнішніх , внутрішніх факторів на кулю для доведення начальникові", "Для ведення записів результатів своєї стрільби для аналізу впливу зовнішніх факторів на кулю"],
        "correct": [2],
        
    },
    {
        "number": 26,
        "question": "На якому етапі заповнення снайперського блокноту ми записуємо дані на вітер?",
        "options": ["Під час стрільби", "Після стрільби, при аналізі даних", "Перед стрільбою", "Напередодні, відповідно даних прогнозу погоду"],
        "correct": [2],
        
    },
    {
        "number": 27,
        "question": "Види балістики:",
        "options": ["Початкова, термінальна, зовнішня", "Внутрішня, зовнішня, кримінальна", "Внутрішня, зовнішня, термінальна", "Термальна, ранева, бронебійна"],
        "correct": [2],
        
    },
    {
        "number": 28,
        "question": "Рекомендована кількість орієнтирів при складанні картки ведення вогню:",
        "options": ["1-2", "10-12", "7-8", "4-5"],
        "correct": [3],
        
    },
    {
        "number": 29,
        "question": "Спосіб стрільби по рухомим цілям?",
        "options": ["Ловля, Супровід", "Ловля, Перехват", "Перехват, Переслідування", "Пошук, Комбінованний"],
        "correct": [0],
        
    },
    {
        "number": 30,
        "question": "Висота цілі 3м, кутові розміри 1.5 MIL. Яка дальність до цілі?",
        "options": ["2200м", "1700м", "1500м", "2000м"],
        "correct": [3],
        
    },
    {
        "number": 31,
        "question": "Обовязкові елементи при складанні картки вогню:",
        "options": ["Орієнтири, дистанція до орієнтирів, зони спостереження, сектор спостереження, значення вітру, сторони горизонту", "Орієнтири, дистанція до орієнтирів, зони спостереження, сектор спостереження, сторони горизонту", "Дистанція до орієнтирів, зони спостереження, сектор спостереження, значення вітру, сторони горизонту", "Орієнтири, дистанція до орієнтирів, зони спостереження, сектор спостереження, значення вітру"],
        "correct": [1],
        
    },
    {
        "number": 32,
        "question": "Які дані повинні бути в журналі ведення спостереження?",
        "options": ["Час спостереження, де та що помічено, спостерігач, кому та коли відбулась доповідь", "Час спостереження, де та що помічено, кому та коли відбулась доповідь", "Кому та коли відбулася доповідь, час спостереження, де та що помічено", "Час спостереження, де та що помічено, спостерігач"],
        "correct": [0],
        
    },
    {
        "number": 33,
        "question": "В чому полягає різниця між кулями G1 від G7?",
        "options": ["Швидкість", "Форма", "Оболонка", "Кутова швидкість"],
        "correct": [1],
        
    },
    {
        "number": 34,
        "question": "Силу вітру визначають за допомогою:",
        "options": ["Флюгеру", "Анемометра", "Термометра", "Барометра"],
        "correct": [1],
        
    },
    {
        "number": 35,
        "question": "Загальна величина відхилення кулі під дією вітру визначається трьома факторами:",
        "options": ["Швидкість та напрямок вітру, траєкторію кулі", "Швидкість та напрям вітру, початкової шидкість кулі", "Швидкість та напрямок вітру, дистанція наяку летить куля", "Температура, вологість, тиск"],
        "correct": [2],
        
    },
    {
        "number": 36,
        "question": "Чому дорівнює 1/4 МОА на дистанції 750м? MOA=3см",
        "options": ["4.1см", "8.25см", "5.62см", "5.44см"],
        "correct": [2],
        
    },
    {
        "number": 37,
        "question": "Яка ціна 1 кліка в сантиметрах на відстані 623 метри?",
        "options": ["0.623см", "6.23см", "62.3см", "623см"],
        "correct": [1],
        
    },
    {
        "number": 38,
        "question": "Скільки секунд в одному градусі?",
        "options": ["60", "600", "360", "3600"],
        "correct": [3],
        
    },
    {
        "number": 39,
        "question": "В який момент куля має найбільшу швидкість?",
        "options": ["За 10-15 мм до виходу з каналу ствола", "При вильоті з каналу ствола", "При вильоті 10-15 см з каналу ствола", "В момент врізання кулі в нарізи"],
        "correct": [2],
        
    },
    {
        "number": 40,
        "question": "Що таке вітер?",
        "options": ["Це – горизонтальне переміщення повітря з зони низького тиску в зону високого тиску", "Це – переміщення повітря в просторі", "Це - горизонтальне переміщення повітря з  зони високого тиску в зону низького тиску", "Це - природне явище яке має фізичний вплив на рух кулі"],
        "correct": [2],
        
    },
    {
        "number": 41,
        "question": "Поправка на повний вітер дорівнює 1 MRAD. Яка поправка на вітер з 01:00?",
        "options": ["1.5 MRAD", "1 MRAD", "0.5 MRAD", "0.3 MRAD"],
        "correct": [2],
        
    },
    {
        "number": 42,
        "question": "Зовнішня балістика це:",
        "options": ["Наука, що вивчає рух кулі (снаряда, гранати) після вильоту з каналу ствола", "Наука, що вивчає рух кулі (снаряда, гранати) після досягнення нею максимальної швидкості", "Наука, що вивчає рух кулі (снаряда, гранати) після припинення дії на неї порохових газів", "Наука, що вивчає рух кулі (снаряда, гранати) після пострілу"],
        "correct": [2],
        
    },
    {
        "number": 43,
        "question": "Траєкторія польоту кулі це:",
        "options": ["Лінія, що описує центр тяжіння кулі в польоті", "Пряма лінія, що описує центр тяжіння кулі в польоті", "Крива лінія, що описує центр тяжіння кулі в польоті", "Зігнута лінія, що описує центр тяжіння кулі в польоті"],
        "correct": [2],
        
    },
    {
        "number": 44,
        "question": "Прямий постріл це:",
        "options": ["Постріл, при якому висота траєкторії польоту кулі не перевищує лінію прицілювання", "Постріл, при якому висота траєкторії польоту кулі не перевищує точку прицілювання", "Постріл, при якому висота траєкторії польоту кулі не виходить за габарити цілі", "Постріл, при якому висота траєкторії польоту кулі не перевищує висоти горизонта зброї"],
        "correct": [2],
        
    },
    {
        "number": 45,
        "question": "Дальність прямого пострілу для UAR – 10 по головній/грудній/ростовій цілі:",
        "options": ["300м/417м/633м", "300м/413м/677м", "300м/413м/673м", "300м/417м/673м"],
        "correct": [1],
        
    },
    {
        "number": 46,
        "question": "Деривація це:",
        "options": ["Відхилення кулі від траєкторії в бік її обертання", "Відхилення кулі від напрямку польоту в бік її обертання", "Відхилення кулі від лінії кидання в бік її обертання", "Відхилення кулі в площині стрільби в бік її обертання"],
        "correct": [3],
        
    },
    {
        "number": 47,
        "question": "Балістичний коефіцієнт це:",
        "options": ["Числова величина яка характерезує кулю долати перешкоду в сантиметрах", "Математична формула для визначення здатності кулі зберігати швидкість і напрямок польоту", "Числова величина яка характерезує здатність кулі долати опір повітря", "Балістична величина, яка характеризує здатність кулі зберігати швидкість і напрямок польоту"],
        "correct": [2],
        
    },
    {
        "number": 48,
        "question": "Що таке дерекційний кут?",
        "options": ["Це кут між напрямком на північ та вашої цілі", "Це кут між напрямком на південь та вашої цілі", "Це кут між північним напрямком вертикальної лінії кілометрової сітки  та напрямком на об’єкт", "Це напрямок на південь за рухом стрілки на компасі"],
        "correct": [2],
        
    },
    {
        "number": 49,
        "question": "Скільки важить ваша куля грамах (UKROP)?",
        "options": ["11.32г", "11.43г", "11.34г", "13.22г"],
        "correct": [2],
        
    },
    {
        "number": 50,
        "question": "51)	Йде дощ. Температура 5˚С. Вітер дує зі швидкістю 3.5 м/с з 3 години. Ваша гвинтівка пристріляна під температуру 15˚С, з вітром 0 м/с (Ваш нуль). Питання: Куди зміститься СТП?",
        "options": ["Право-верх", "Ліво-низ", "Ліво-верх", "Право-низ"],
        "correct": [1],
        
    },


]
