survey_title = "ТЕСТ 40 ПИТАНЬ"

questions = [
    {
        "number": 1,
        "question": "Довжина ствола вашої гвинтівки, в дюймах?",
        "options": ["22", "27", "24,5", "20"],
        "correct": [3],
        "depends_on": None
    },
    {
        "number": 2,
        "question": "Перегаз – гільза при пострілі вилітає на:",
        "options": ["05:00 - 3:30", "02:00 - 03:00", "2:30 - 3:30", "01:00 - 02:30"],
        "correct": [3],
        "depends_on": None
    },
    {
        "number": 3,
        "question": "Недогаз - гільза при пострілі вилітає на:",
        "options": ["03:30 - 02:30", "03:30 - 05:00", "01:00 - 02:00", "10:00 - 11:30"],
        "correct": [2],
        "depends_on": None
    },
    {
        "number": 4,
        "question": "***Крок нарізів вашого ствола, вказати рік випуску гвинтівки?",
        "options": ["1:12”", "1:11” 2019", "1:8”", "1:10” 2023"],
        "correct": [3],
        "depends_on": None
    },
    {
        "number": 5,
        "question": "Контур ствола:",
        "options": ["Матчевий", "Важкий", "Легкий", "Середній"],
        "correct": [1],
        "depends_on": None
    },
    {
        "number": 6,
        "question": "Для чого потрібно регулювати паралакс на дистанції?",
        "options": ["Для чіткості сітки", "Для чіткості цілі відносно кратності", "Для чіткості міражу", "Для виведення цілі і сітки прицілу в одну площину"],
        "correct": [3],
        "depends_on": None
    },
    {
        "number": 7,
        "question": "***Які види снайперських гвинтівок за типом заряджання ви знаєте? (Оберіть 2 варіанти)",
        "options": ["Автоматична гвинтівка", "Гвинтівка з повздовжнім затвором", "Напівавтоматична гвинтівка", "Гвинтівка з повздовжньо-ковзаючим затвором"],
        "correct": [3],
        "depends_on": None
    },
    {
        "number": 8,
        "question": "Скільки МОА в 15 MRAD (точне значення)?",
        "options": ["50.57 МОА", "51.57 МОА", "53.56 МОА", "52.57 МОА"],
        "correct": [2],
        "depends_on": None
    },
    {
        "number": 9,
        "question": "Вирахуйте розмір цілі в сантиметрах, за умови відстань до цілі 600 м. ширина цілі 0.5 MRAD:",
        "options": ["40 см.", "30 см.", "20 см.", "50 см."],
        "correct": [2],
        "depends_on": None
    },
    {
        "number": 10,
        "question": "Скільки ярдів у 100м?",
        "options": ["114", "109", "132", "91"],
        "correct": [2],
        "depends_on": None
    },
    {
        "number": 11,
        "question": "Яка з гвинтівок є антиматеріальною?",
        "options": ["AIXMC 338", "Barrett M82A1", "M24", "TRG 22"],
        "correct": [1],
        "depends_on": None
    },
    {
        "number": 12,
        "question": "Які кутові величини ви знаєте?",
        "options": ["МОА, Mil, Дюйм, Тисячна", "Mil, МОА, Тисячна, Фунт.", "МОА, Mil, Градус, Тисячна"],
        "correct": [2],
        "depends_on": None
    },
    {
        "number": 13,
        "question": "Балістика – це:",
        "options": ["Наука, що вивчає рух і зіткнення предметів", "Наука, що вивчає поводження предметів у просторі", "Наука, що вивчає рух і зіткнення снарядів"],
        "correct": [2],
        "depends_on": None
    },
    {
        "number": 14,
        "question": "Що таке «твіст»?",
        "options": ["Це розмір нарізу", "Це відстань, за яку куля робить повний оберт у каналі ствола", "Це відстань від патронника до нарізів"],
        "correct": [1],
        "depends_on": None
    },
    {
        "number": 15,
        "question": "Скільки секунд в одному градусі?",
        "options": ["60", "360", "600", "3600"],
        "correct": [3],
        "depends_on": None
    },
    {
        "number": 16,
        "question": "Поправка на дистанцію на вітер 1 MRAD на повний вітер. Яка буде поправка, якщо напрямок вітру буде з 01:00?",
        "options": ["1.5 MRAD", "1 MRAD", "0.5 MRAD", "0.3 MRAD"],
        "correct": [2],
        "depends_on": None
    },
    {
        "number": 17,
        "question": "Дайте опис Балістичної (тактичної) сітки.",
        "options": ["1.5 MRAD", "1 MRAD", "0.5 MRAD", "0.3 MRAD"],
        "correct": [2],
        "depends_on": None
    },
    {
        "number": 18,
        "question": "Що вивчає термінальна балістика?",
        "options": ["Дію снаряду на тіло людини", "Дію снаряду на перешкоду", "Поводження снаряду перед влучанням"],
        "correct": [1],
        "depends_on": None
    },
    {
        "number": 19,
        "question": "Для чого потрібен блокнот снайпера?",
        "options": ["Для ведення формуляра", "Для записів аналізу результатів стрільби", "Для записів результатів стрільби та аналізу впливу факторів"],
        "correct": [2],
        "depends_on": None
    },
    {
        "number": 20,
        "question": "На якому етапі заповнення снайперського блокноту ми записуємо дані на вітер?",
        "options": ["Під час стрільби", "Після стрільби", "Перед стрільбою", "Напередодні"],
        "correct": [2],
        "depends_on": None
    }
]
